/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "以下 %1$[任一]@ 條件為是";
"%[All]@ of the following are true" = "以下 %1$[全部]@ 條件為是";
"%[None]@ of the following are true" = "以下 %1$[沒有]@ 條件為是";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[種類]@ 是 %2$[所有]@";
"%[Kind]@ is %[applications]@" = "%1$[種類]@ 是 %2$[應用程式]@";
"%[Kind]@ is %[documents]@" = "%1$[種類]@ 是 %2$[文件]@";
"%[Kind]@ is %[folders]@" = "%1$[種類]@ 是 %2$[檔案夾]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[種類]@ 是 %2$[影像]@ %3$[所有]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[種類]@ 是 %2$[影像]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[種類]@ 是 %2$[影像]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[種類]@ 是 %2$[影像]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[種類]@ 是 %2$[影像]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[種類]@ 是 %2$[影像]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[種類]@ 是 %2$[音樂]@ %3$[所有]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[種類]@ 是 %2$[音樂]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[種類]@ 是 %2$[音樂]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[種類]@ 是 %2$[音樂]@ %3$[已購買]@";
"%[Kind]@ is %[PDF]@" = "%1$[種類]@ 是 %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[種類]@ 是 %2$[簡報]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[種類]@ 是 %2$[文字]@ %3$[所有]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[種類]@ 是 %2$[文字]@ %3$[純文字]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[種類]@ 是 %2$[文字]@ %3$[RTF]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[種類]@ 是 %2$[文字]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[種類]@ 是 %2$[文字]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[種類]@ 是 %2$[文字]@ %3$[原始碼]@";
"%[Kind]@ is %[movies]@" = "%1$[種類]@ 是 %2$[影片]@";
"%[Kind]@ is %[other]@ %@" = "%1$[種類]@ 是 %2$[其他]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ 是 %2$[在過去]@ %3$@ %4$[天]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ 是 %2$[在過去]@ %3$@ %4$[週]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ 是 %2$[在過去]@ %3$@ %4$[個月]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ 是 %2$[在過去]@ %3$@ %4$[年]@";
"%@ is %[exactly]@ %@" = "%1$@ 是 %2$[正好是]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ 是 %2$[早於]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ 是 %2$[晚於]@ %3$@";
"%@ is %[today]@" = "%1$@ 是 %2$[今天]@";
"%@ is %[yesterday]@" = "%1$@ 是 %2$[昨天]@";
"%@ is %[this week]@" = "%1$@ 是 %2$[本週]@";
"%@ is %[this month]@" = "%1$@ 是 %2$[本月]@";
"%@ is %[this year]@" = "%1$@ 是 %2$[今年]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[包含]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[開頭為]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[結尾為]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[是]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[符合]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[所有]@";
"%@ %[yes]@" = "%1$@ %2$[是]@";
"%@ %[no]@" = "%1$@ %2$[否]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[檔案是否顯示]@ %2$[顯示項目]@";
"%[File invisible]@ %[invisible items]@" = "%1$[檔案是否顯示]@ %2$[隱藏項目]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[檔案是否顯示]@ %2$[顯示或隱藏]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Raw 查詢]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[副檔名]@ %2$[是]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[等於]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[大於]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[小於]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[不是]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ 包含 %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[等於]@ %3$@ %4$[KB]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[等於]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[等於]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[小於]@ %3$@ %4$[KB]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[小於]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[小於]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[大於]@ %3$@ %4$[KB]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[大於]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[大於]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[不是]@ %3$@ %4$[KB]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[不是]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[不是]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[等於]@ %3$@ 小時 %4$@ 分鐘 %5$@ 秒";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[小於]@ %3$@ 小時 %4$@ 分鐘 %5$@ 秒";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[大於]@ %3$@ 小時 %4$@ 分鐘 %5$@ 秒";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[不是]@ %3$@ 小時 %4$@ 分鐘 %5$@ 秒";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[符合以下文字的項目]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[系統檔案]@ %2$[包含]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[系統檔案]@ %2$[不包含]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Spotlight 項目]@ %2$[包含]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Spotlight 項目]@ %2$[不包含]@";
